app/views/tasks/_task_boxes.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND (tasks.start_time >= '2024-09-09') AND (tasks.start_time <= '2024-09-15') AND (tasks.start_time >= '2024-09-09') AND (tasks.start_time <= '2024-09-09')  [["user_id", 2]]
---
<td class="table_data_box" id = "task_box<%= Date.commercial(current_year, current_week,1)%>">
  <% current_user.tasks.from_date(Date.commercial(current_year, current_week , 1)).to_date(Date.commercial(current_year, current_week , 1)).each do |task|  %>