app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "start_time", "end_time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @task = Task.new(task_params)
    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "start_time" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["start_time", "2024-09-14 05:59:00"], ["updated_at", "2024-09-14 09:58:11.872507"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)